{
    "responses": [
      {
        "title": "Removing Splash Learn from Teacher Page",
        "content": "Hello Nancy,\n\nI hope you're having a wonderful day! Thank you for reaching out to Clever Support—I'm glad to assist you.\n\nIf you're looking to remove Splash Learn from your teacher page, you can do so by navigating to [this page](https://clever.com/in/carteret/library/app/splashmathsync) in your Clever Portal. Under 'Page Installs' you can then click the small 'x' next to 'N.Carr's Page' to uninstall Splash Learn.\n\nHowever, if I've misunderstood your request, please don't hesitate to let me know. I apologize for any confusion and am happy to clarify. Should you have any additional questions or concerns, feel free to reach out. I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "Clever Badges Information for Parents",
        "content": "Hello Patricia,\n\nThank you for reaching out to Clever Support! As discussed, I've included the article below, which you can share with parents regarding Clever Badges. This resource is designed to help families get acquainted with Clever Badges.\n\nClever Help Center Article: [For Families: Clever Badges](https://support.clever.com/s/articles/360020790571?language=en_US)\n\nPlease don't hesitate to reach out if you have any further questions or concerns regarding this case. I am here to help!\n\nKind Regards,"
      },
      {
        "title": "Changing School_ID Field in Clever",
        "content": "Hello Scott,\n\nThis is certainly possible, but I wanted to bring something to your attention regarding the School_ID in Clever. The School_ID is essentially tied to the Clever ID, which stores all historical data for that record type.\n\nIf we change the field that Clever uses for the School_ID from `schools.id` to `schools.school_number`, this will cause the School_ID and Clever ID to change. This would match up with the School_ID your district is currently exporting in the staff.csv, but as a result, it would appear as if the schools have entirely new accounts in Clever and within third-party applications.\n\nTo address this, we can migrate the data from the old Clever ID to the new one, ensuring the preservation of historical data for each school site. However, this process may take up to 1-2 weeks, depending on how many app partners are currently using the existing School_IDs for your district.\n\nPreserving the historical data is optional, so please let me know if you would like us to proceed with both the field change and historical data migration, or if you prefer to make the field change without preserving the historical data. I want to ensure we take the path that works best for you.\n\nIf I've misunderstood anything, please feel free to correct me, and I apologize in advance for any confusion. Don't hesitate to reach out if you have any further questions or concerns. I'm happy to assist in any way I can!\n\nKind Regards,"
      },
      {
        "title": "Clarification on Vector EDU Integration",
        "content": "Hello Alejandro,\n\nThank you for your clarification. I checked, but at this time, there is no official integration for Clever titled 'Vector EDU' or 'Vector Education'. We wanted to confirm your specific needs and how Clever Support may assist. However, since there is currently no app titled 'Vector EDU' integrated with Clever, we recommend reaching out to the appropriate support team if this matter is unrelated to Clever and its integrations.\n\nIf there is indeed a Clever app titled 'Vector EDU' and you have documentation confirming this integration, please feel free to share it with us, and we'll be happy to assist further.\n\nThe Madison Parish School District currently has a Clever app launched called 'Vector Solutions.' However, this is a Saved Passwords SSO app, not a SAML or rostering app.\n\nThis means that students and teachers will be directed to https://globalprepindy-in.safeschools.com/login when launching this Saved Passwords app, where they will need to enter their existing credentials to log into Vector Training once. Clever will then save those credentials using the Clever Browser Extension. Please note that this app does not utilize SAML or Metadata links and is not designed for rostering or creating accounts.\n\nIf I've misunderstood anything, please feel free to let me know. I apologize in advance for any confusion and am happy to clarify further if needed.\n\nKind Regards,"
      },
      {
        "title": "Pearson - aimswebPlus Integration Request",
        "content": "Hello Keri 👋,\n\nI hope you're having a wonderful day! Thank you so much for reaching out to Clever Support—you're definitely in the right place, and I'm here to assist you.\n\nFrom what I understand, Pearson - aimswebPlus Support has advised you to contact Clever Support to initiate the Clever Pearson - aimswebPlus rostering app integration.\n\nThis integration would automatically sync your district's SIS data into Clever, allowing users to seamlessly SSO into Pearson - aimswebPlus from their Clever Portal. If I've misunderstood, please don't hesitate to let me know, and I apologize for any confusion.\n\nIf this is correct, only your district's Clever Admin has the ability to launch the Pearson - aimswebPlus integration from the Clever admin dashboard, as this is a district-wide integration that would impact the entire district. You would need to contact your district's Clever Tech Support contact at [Help@tacoma.k12.wa.us](mailto:Help@tacoma.k12.wa.us), as they have the necessary access to launch this app. For your convenience, I've copied them on this email.\n\nPlease feel free to reach out if you have any further questions or concerns—I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "Exporting Clever Badges as Code or Excel-Compatible Format",
        "content": "Hello John,\n\nThank you so much for reaching out to Clever Support! As we discussed, I will be forwarding your request to our engineering team to explore whether it is possible to export Clever Badges as a code or in a format compatible with Excel.\n\nPlease feel free to reach out if you have any further questions or concerns. I'm happy to assist in any way I can!\n\nKind Regards,"
      },
      {
        "title": "GoGuardian Support Update",
        "content": "Hello GoGuardian Support,\n\nThank you for the update! Please feel free to reach out if anything arises with this request, or if any further assistance from Clever is required. I'm happy to help in any way I can.\n\nKind Regards,"
      },
      {
        "title": "Custom Fields in students_ext.csv File",
        "content": "Hello Danny,\n\nI hope this message finds you well! Thank you for contacting Clever Support.\n\nTo address your question, you would only be able to upload a **single** CSV file titled '**students_ext.csv**' that contains the custom fields. However, please note that you are able to include multiple custom fields within this '**students_ext.csv**' file, as shown below.\n\nI've attached a template to this email for your reference, should you need it. Additionally, please note that our team may be able to map certain fields from Aeries to the corresponding student fields in Clever, which would eliminate the need for manually uploading a CSV file. For instance, we may be able to map '**Students with Disabilities**' to '**Disability Status**' in Clever, and '**Economically Disadvantaged**' to one of the available fields below.\n\nHowever, please be aware that we can only map fields that currently exist within Clever. If a specific field is not available, it may be best to continue using the manual [Custom Data Extension Fields](https://support.clever.com/hc/s/articles/360024370912?language=en_US) as you have been.\n\nFeel free to reach out if you have any further questions or need clarification.\n\nKind Regards,"
      },
      {
        "title": "Login Issue Follow-up",
        "content": "Hello Marcie,\n\nThank you for the update! I noticed that you have two open Clever cases, and it seems that this response may have been sent to both.\n\nAccording to the [Login Logs](https://schools.clever.com/instant-login/logs), Jami Kroulik successfully logged into Clever yesterday.\n\nHowever, I understand that this may be different from what the teacher is experiencing on their end. Before our team troubleshoots this with Jami, I wanted to check in with you—Is Jami still experiencing any issues with logging into Clever?\n\nPlease let me know, and I'll be happy to assist further.\n\nKind Regards,"
      },
      {
        "title": "Updating District Contact Information and SSO Login Method",
        "content": "Hello Perry 👋,\n\nI hope you're having a wonderful day! Thank you for reaching out to Clever Support. You've come to the right place, and I'm happy to assist with your request.\n\nIf I understand correctly, you're looking to update your district's contact information as illustrated in the screenshot below\n\nIf that's the case, you can do so by navigating to [this](https://schools.clever.com/instant-login/accesscontrol) page in the Clever Dashboard.\n\nAdditionally, if you'd like to update your SSO login method, you can manage that through [this](https://schools.clever.com/instant-login/settings) page in the Clever Dashboard as well.\n\nHowever, if I've misunderstood your request, please don't hesitate to let me know. I apologize for any confusion and am more than happy to clarify. Feel free to reach out if you need any further assistance with your Clever account. For more insights on setting up your district's Login Method in Clever, you might find this informative article helpful: Single Sign-On (SSO): [Identity Provider (IDP)/Login Method Options](https://support.clever.com/s/articles/203166787?language=en_US)\n\nKind Regards,"
      },
      {
        "title": "School_ID Mismatch in staff.csv File",
        "content": "Hello Scott 👋,\n\nI hope you're having a pleasant day! Thank you for reaching out to Clever Support. You've come to the right place, and I'm here to assist with your inquiry.\n\nThe issue your district is encountering seems to stem from a mismatch between the data in the **School_ID** column in the **staff.csv** file and the data currently being rostered from your district's PowerSchool instance into Clever. Below is a screenshot of the latest data exported in the staff.csv file.\n\nTo provide an example, let's look at **Wahpeton Senior High School**. In Clever, the **School_ID** for Wahpeton Senior High School is **'5'**, as shown in the image below.\n\nIt's important to note that Clever is not assigning these **School_IDs**. These are rostered from your district's PowerSchool instance, specifically from the **'schools.id'** field. You can review this in your district's field mappings on [this](https://schools.clever.com/sync/settings/mappings) page in the Clever Dashboard.\n\nIn other words, the **'schools.id'** field in **PowerSchool** should have a value of **'5'** for Wahpeton Senior High School to match what is rostered in Clever. This School_ID data is mapped from PowerSchool.\n\nTo resolve the issue with the staff.csv file, either you or your SIS Admin will need to configure the **staff.csv** SFTP exports to ensure that the **School_ID** matches the values being rostered from PowerSchool.\n\nFor instance, the **School_ID** for Wahpeton Senior High School should be **'5'** in the staff.csv export (from PowerSchool's **'schools.id'** field).\n\nWhile the **School_Number** for Wahpeton Senior High School is **'9170'** (from PowerSchool's **'schools.school_number'** field), the staff.csv file requires the **School_ID**, not the **School_Number**. This adjustment will need to be made by the person responsible for setting up the staff.csv exports on your district's end.\n\nPlease feel free to reach out if you need any further clarification or assistance. I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "Follow-up on Pending Requests",
        "content": "Hello HSDigitalfulfillment,\n\nThank you!\n\nHello Emily,\n\nPlease feel free to provide any updates on this request. Don't hesitate to reach out if you need any further assistance—we're here to help.\n\nKind Regards,"
      },
      {
        "title": "Removing Splash Learn from Teacher Page",
        "content": "Hello Nancy,\n\nI hope you're having a wonderful day! Thank you for reaching out to Clever Support—I'm glad to assist you.\n\nIf you're looking to remove Splash Learn from your teacher page, you can do so by navigating to [this page](https://clever.com/in/carteret/library/app/splashmathsync) in your Clever Portal. Under '**Page Installs**' you can then click the small '**x**' next to '**N.Carr's Page**' to uninstall Splash Learn.\n\nHowever, if I've misunderstood your request, please don't hesitate to let me know. I apologize for any confusion and am happy to clarify. Should you have any additional questions or concerns, feel free to reach out. I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "Clever Badges Information for Parents",
        "content": "Hello Patricia,\n\nThank you for reaching out to Clever Support! As discussed, I've included the article below, which you can share with parents regarding Clever Badges. This resource is designed to help families get acquainted with Clever Badges.\n\nClever Help Center Article: [For Families: Clever Badges](https://support.clever.com/s/articles/360020790571?language=en_US)\n\nPlease don't hesitate to reach out if you have any further questions or concerns regarding this case. I am here to help!\n\nKind Regards,"
      },
      {
        "title": "Changing School_ID Field in Clever",
        "content": "Hello Scott,\n\nThis is certainly possible, but I wanted to bring something to your attention regarding the **School_ID** in Clever. The **School_ID** is essentially tied to the **Clever ID**, which stores all historical data for that record type.\n\nIf we change the field that Clever uses for the **School_ID** from `schools.id` to `schools.school_number`, this will cause the **School_ID** and **Clever ID** to change. This would match up with the School_ID your district is currently exporting in the staff.csv, but as a result, it would appear as if the schools have entirely new accounts in Clever and within third-party applications.\n\nTo address this, we can migrate the data from the old Clever ID to the new one, ensuring the preservation of historical data for each school site. However, this process may take up to 1-2 weeks, depending on how many app partners are currently using the existing School_IDs for your district.\n\nPreserving the historical data is optional, so please let me know if you would like us to proceed with both the field change and historical data migration, or if you prefer to make the field change without preserving the historical data. I want to ensure we take the path that works best for you.\n\nIf I've misunderstood anything, please feel free to correct me, and I apologize in advance for any confusion. Don't hesitate to reach out if you have any further questions or concerns. I'm happy to assist in any way I can!\n\nKind Regards,"
      },
      {
        "title": "Clarification on Vector EDU Integration",
        "content": "Hello Alejandro,\n\nThank you for your clarification. I checked, but at this time, there is no official integration for Clever titled 'Vector EDU' or 'Vector Education'. We wanted to confirm your specific needs and how Clever Support may assist. However, since there is currently no app titled 'Vector EDU' integrated with Clever, we recommend reaching out to the appropriate support team if this matter is unrelated to Clever and its integrations.\n\nIf there is indeed a Clever app titled 'Vector EDU' and you have documentation confirming this integration, please feel free to share it with us, and we'll be happy to assist further.\n\nThe Madison Parish School District currently has a Clever app launched called 'Vector Solutions.' However, this is a Saved Passwords SSO app, not a SAML or rostering app.\n\nThis means that students and teachers will be directed to https://globalprepindy-in.safeschools.com/login when launching this Saved Passwords app, where they will need to enter their existing credentials to log into Vector Training once. Clever will then save those credentials using the Clever Browser Extension. Please note that this app does not utilize SAML or Metadata links and is not designed for rostering or creating accounts.\n\nIf I've misunderstood anything, please feel free to let me know. I apologize in advance for any confusion and am happy to clarify further if needed.\n\nKind Regards,"
      },
      {
        "title": "Pearson - aimswebPlus Integration Request",
        "content": "Hello Keri 👋,\n\nI hope you're having a wonderful day! Thank you so much for reaching out to Clever Support—you're definitely in the right place, and I'm here to assist you.\n\nFrom what I understand, Pearson - aimswebPlus Support has advised you to contact Clever Support to initiate the Clever Pearson - aimswebPlus rostering app integration.\n\nThis integration would automatically sync your district's SIS data into Clever, allowing users to seamlessly SSO into Pearson - aimswebPlus from their Clever Portal. If I've misunderstood, please don't hesitate to let me know, and I apologize for any confusion.\n\nIf this is correct, only your district's Clever Admin has the ability to launch the Pearson - aimswebPlus integration from the Clever admin dashboard, as this is a district-wide integration that would impact the entire district. You would need to contact your district's Clever Tech Support contact at [Help@tacoma.k12.wa.us](mailto:Help@tacoma.k12.wa.us), as they have the necessary access to launch this app. For your convenience, I've copied them on this email.\n\nPlease feel free to reach out if you have any further questions or concerns—I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "Follow-up on Pearson—aimswebPlus Inquiry",
        "content": "Hello Cole,\n\nI hope you're doing well! I wanted to follow up regarding your recent inquiry with Pearson—aimswebPlus. Have you had a chance to hear back from them on this matter?\n\nIf there's anything Clever Support can assist with, please don't hesitate to let me know. Should their request involve adding the StateDistrictID as a Custom Extension Data field for your school sites, I'd be happy to help with that. Just a reminder, each school site in Clever would need to have a StateDistrictID.\n\nIf I've misunderstood anything, I apologize for the confusion. Please feel free to clarify if needed.\n\nAs always, if you have any further questions or concerns, I'm here to assist!"
      },
      {
        "title": "Accounting Team Information",
        "content": "The accounting team is 4 people\n\nnon-exempt = we get overtime"
      },
      {
        "title": "Clever IDs for Sections",
        "content": "Hello Chris 👋,\n\nI hope you're having a pleasant day! Thank you for reaching out to Clever Support—I'm happy to assist you with your inquiry.\n\nThe **Clever ID** is a unique identifier generated by Clever for each record type. This means that both school sites and individual sections have their own Clever IDs.\n\nIf I understand correctly, you are requesting the **Clever IDs** for each of your **905** sections in Clever to use as unique identifiers for setting up a new attendance process with the Otus app. Please feel free to correct me if I've misunderstood, and I apologize in advance for any confusion.\n\nIf this is indeed your request, I'd be happy to provide you with a spreadsheet containing the Clever IDs for all 905 sections in your Clever instance. Additionally, the Otus Clever Application should already have this information available as well. You can also download all of this by navigating to [this](https://schools.clever.com/applications/otus) page and clicking the download button next to sections. The column titled '**id**' would be the Clever IDs for each section in the **sections.csv**.\n\nShould you have any further questions or need additional assistance, please don't hesitate to reach out. I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "Veracross Sections Export Update",
        "content": "Hello William,\n\nThank you for the update. I reviewed the latest sections.csv export from Veracross today, and you may be right. It appears that only **124** sections were loaded, compared to the **934** sections previously in Clever for your district. The 124 sections primarily have a term start date of 08-28-2024 and a term end date of 06-10-2025.\n\nAs you mentioned, if additional sections and courses need to be rostered into Clever, it might be best to contact Veracross so they can adjust this in the next export. We'll keep this case open for now, in case any follow-up is needed from our side once the sections.csv is updated by Veracross.\n\nKind Regards,"
      },
      {
        "title": "Clever Sync Issue Resolution",
        "content": "Hello Jason,\n\nI hope you're doing well. Thank you so much for your patience while our engineering team worked on this issue. Based on the latest updates, this issue should now be resolved. When you have a chance, could you please check your Clever Dashboard to confirm if your Clever Sync is still stuck or if it is now functioning correctly?\n\nPlease don't hesitate to reach out if you need any further assistance."
      },
      {
        "title": "Clever Badges Printing Issue",
        "content": "Hello Joseph👋,\n\nI trust you're enjoying a pleasant day. I'd like to extend my appreciation for reaching out to Clever Support. You're in the right place, and I'm here to provide the assistance you need.\n\nI wanted to check in to see if the teacher is still experiencing issues with printing badges for the students. I believe I may have identified the cause of the issue.\n\nIt seems that the reason the teacher may be unable to print badges for students, is that students currently do not meet your district's badge criteria set on [this](https://schools.clever.com/badges/settings) page in the Clever Dashboard.\n\nSpecifically, it appears that the specific **Grade level** for all students is not populated in Clever, based on the data being received from Alma SIS.\n\nTo verify this, you can download the latest dataset Alma SIS has sent to Clever by clicking '**Download SIS File**' on the student row on [this](https://schools.clever.com/sync) page.\n\nYou'll notice that the **Grade field** is blank for all students. This is why they do not meet the badge criteria set by your district (which is to allow badges for all students from **Transitional Kindergarten** to **4th Grade**).\n\nTo resolve this, your district can either contact Alma SIS to ensure that the correct **Grade level** for each student is exported to Clever, or you may adjust the badge criteria in your Clever Dashboard to include the grade level of '**Other**'. Since all students are marked as grade level 'Other' in Clever, this will allow Clever Badges to be available for all students.\n\nPlease let me know if you need further assistance or clarification. I'm happy to help in any way I can! For more insights on Clever Badges, you might find this informative article helpful: [Clever Badges: Overview and setup](https://support.clever.com/s/articles/220213907?language=en_US)"
      },
      {
        "title": "Connecting to an Existing Clever District",
        "content": "Hello Scott 👋,\n\nI hope you're having a great day! I sincerely appreciate you reaching out to Clever Support. Rest assured, you're in the right place, and I'm here to assist you with anything you need.\n\nI apologize for any delays on Clever's end. When available, could you kindly clarify the specific request you needed Clever Support to address? The subject mentions 'Connecting to an existing Clever District,' and we just need to know the name of the district you'd like to connect with. Additionally, could you please confirm whether you are a district representative or an app partner? This will help us ensure your request is directed to the appropriate team.\n\nIt seems like you may have been trying to set up an app connection for a district, but we wanted to make sure we fully understand the details and the district involved. If I've misunderstood any part of your request, please feel free to correct me—I sincerely apologize for any confusion.\n\nLooking forward to your response, and I'm here to assist with whatever you need!\n\nKind Regards,"
      },
      {
        "title": "Notes on Macros",
        "content": "Basically the macros do the repetitive thinking for you - quickly.\n\nThere's even macros to highlight and color the exact changes for you."
      },
      {
        "title": "Feedback on Project Collaboration",
        "content": "CJ was awesome to work with - I'm glad I got to work with her and Vy. I'm glad I got to experience what it takes to execute ideas - and this project is something I really enjoyed! Thank you!"
      },
      {
        "title": "Feedback on Project Collaboration",
        "content": "CJ was awesome to work with - I'm glad I got to work with her and Vy. I'm glad I got to experience what it takes to execute ideas - and this project is something I really enjoyed! Thank you!"
      },
      {
        "title": "Note on Macros",
        "content": "There's even macros to highlight and color the exact changes for you"
      },
      {
        "title": "Clever Badges QR Code Export Limitation",
        "content": "Hello John,\n\nI hope you're doing well. At the moment, the Clever Dashboard does not have the functionality to convert Clever Badges QR Codes into an Excel file with student names and QR code numbers. While this feature isn't available, we wanted to check with our engineering team to explore if it could be provided for your district. Unfortunately, our team is unable to offer this service, as Clever currently only supports generating the badges as QR codes in the standard format.\n\nWe sincerely apologize for any inconvenience this may cause and appreciate your understanding. Please don't hesitate to reach out if you have any further questions or concerns regarding this case.\n\nKind Regards,"
      },
      {
        "title": "Reporting Race as 'Unknown' to NWEA",
        "content": "Hello Austin👋,\n\nI trust you're enjoying a pleasant day. I'd like to extend my appreciation for reaching out to Clever Support. You're in the right place, and I'm here to provide the assistance you need.\n\nTo ensure that Clever reports the '**Race**' as '**Unknown**' for all students to NWEA, your SIS admin will need to add a '**Race**' column in the **students.csv** file and enter '**Unknown**' for each relevant record. Here's an example of how it should be structured:\n\nAdditionally, I wanted to share the main Clever-supported letter values for **race**, which are as follows:\n\n- **A**: Asian\n- **B**: Black or African-American\n- **I**: American Indian or Alaska Native\n- **M**: Multiracial\n- **P**: Hawaiian or Pacific Islander\n- **W**: White\n\nI also wanted to mention that I found this information in a very helpful resource, which outlines all the Clever-supported value types for each record. You can find more details in this article: Clever's [SFTP Specifications](https://schools.clever.com/files/district-sftp.pdf)\n\nPlease let me know if you have any further questions!\n\nKind Regards,"
      },
      {
        "title": "Student Sections Not Appearing in Clever",
        "content": "Hello Angelle👋,\n\nI trust you're enjoying a pleasant day. I'd like to extend my appreciation for reaching out to Clever Support. You're in the right place, and I'm here to provide the assistance you need.\n\nThe reason why student [67071ad623d8ee1ee10d883a](https://schools.clever.com/users/67071ad623d8ee1ee10d883a/student) does not have any sections listed in Clever, is because the student is not enrolled in any section in the **enrollments.csv** your SIS is exporting to Clever\n\nAccording to our records, your district's SIS is listed as JCampus SIS, and your Clever instance is set up with a SFTP (SIS-managed) sync with JCampus.\n\nThis means that every day, around 5:00 pm PDT, JCampus ****exports files (**students.csv**, **teachers.csv**, **enrollments.csv**, **sections.csv**, and **schools.csv**) to Clever via SFTP, containing all your district's data from JCampus for syncing.\n\nYou can verify the contents of the **enrollments.csv** by navigating to [this](https://schools.clever.com/sync) page in the Clever Dashboard and clicking '**Download SIS File**' on the sections row.\n\nA file will be emailed to you, once you receive it open up the **enrollments.csv** to see the latest **enrollments.csv** that was exported from JCampus. You will notice that the Student ID of [**5359881**](https://schools.clever.com/users/67071ad623d8ee1ee10d883a/student)  is not listed on the enrollments file that was exported from JCampus.\n\nTo resolve this issue, I recommend working with your SIS admin to ensure that student enrollments for [67071ad623d8ee1ee10d883a](https://schools.clever.com/users/67071ad623d8ee1ee10d883a/student)  are included in the **enrollments.csv** that is being exported from JCampus. Once confirmed, please run a new export from JCampus, and this should resolve the issue.\n\nPlease feel free to reach out if you have any further questions or need additional assistance.\n\nKind Regards,"
      },
      {
        "title": "Teacher Primary School Assignment in Clever",
        "content": "Hello Susan 👋,\n\nI hope you're having a great day! Thank you for reaching out to Clever Support — we truly appreciate it, and I'm here to assist you.\n\nBy default, primary school assignments in Clever are based on teacher and student enrollments. In this case, since [Sabrina Montalbano](https://schools.clever.com/users/66d10021990afb0331be8ebc/teacher) teaches **more** classes at **Samoset Middle School**, their primary school association has been automatically set to Samoset Middle School in Clever.\n\nHowever, we have the option to modify this logic for your district so that the primary school association is determined solely by the data provided in the **teachers.csv** file that is being rostered from **eSchoolData**, and not by the majority of sections they are enrolled in.\n\nIf you'd like us to make this adjustment for your Clever instance, please note that it will apply to all teachers within your Clever account. If I've misunderstood, please feel free to let me know, and I apologize in advance for any confusion.\n\nIf you have any further questions or need additional clarification, please don't hesitate to reach out. I'm more than happy to help!\n\nKind Regards,"
      },
      {
        "title": "Adding Content Assignment Tab for Kognity",
        "content": "Hello Jay,\n\nI hope you're having a wonderful day! Thank you for reaching out to Clever Support. Rest assured, you're in good hands, and I'm here to assist with whatever you need.\n\nI've contacted our specialist team to request the addition of the Content Assignment tab for Kognity to your Dashboard. They will provide an update as soon as this has been completed. In the meantime, if you have any further questions or concerns, please don't hesitate to reach out—I'm more than happy to help.\n\nIf I've misunderstood any part of your request, I sincerely apologize and encourage you to let me know.\n\nKind Regards,"
      },
      {
        "title": "Clever Q1 Term Section Data Removal",
        "content": "Hello Jonathan,\n\nI apologize for any delays on Clever's end. The investigation is still ongoing, but so far it appears that the **Q1 term** section data may have been removed from your district's Clever instance on October 7th.\n\nWhile we are still determining the official cause, it's important to note that sections must have at least one student enrollment in order to be rostered into Clever. It's possible that if all students were unenrolled from the Q1 sections on October 7th, those sections were subsequently removed from Clever due to the lack of active enrollments.\n\nTo answer your question regarding the Formative app - If your goal is to delay any **bulk deletions** or **changes** to section data in a specific app, such as Formative, you can initiate an **App Sync Pause** from [this](https://schools.clever.com/applications/formative-rostering-dev/settings) page.\n\nThis will freeze the current data in the app, stopping any new changes from Clever's automatic sync from being sent to the app. I understand that the Q1 Term section data has already been removed from Formative, but using this feature could help prevent similar issues in the future, depending on what our team finds as the cause for the Q1 Term being removed from Clever.\n\nWe will continue to investigate and keep you updated as soon as we have more information.\n\nKind Regards,"
      },
      {
        "title": "Edupoint SIS Teacher Data Export",
        "content": "Hello John,\n\nThank you for the update! I reviewed the latest ***teachers.csv*** file exported from **Edupoint** into Clever at 12:00 AM PST on 10/22.\n\nWhile Edupoint has successfully reverted the changes to the ***Teacher_ID***, which is a great first step, it seems the ***ext.TeacherLicenseNumber*** column header and corresponding data have not yet been added to the ***teachers.csv*** file.\n\nTo verify the contents, you can navigate to [this](https://schools.clever.com/sync) page in the Clever Dashboard, navigate to the *teachers* row, and click '**Download SIS File**'.\n\nYou will receive an email with the file; once it arrives, open it to view the most recent *teachers.csv* export from Edupoint SIS. You'll notice that the *ext.TeacherLicenseNumber* column is still missing.\n\nTo resolve this, I recommend working with your SIS admin to ensure the *teachers.csv* file includes the *ext.TeacherLicenseNumber* column header, and then initiate a new export to Clever.\n\nPlease feel free to reach out if you need any further assistance.\n\nKind Regards,"
      },
      {
        "title": "Clever Account Types and GoGuardian Access",
        "content": "Hello Andy,\n\nThank you for getting back to me, and no worries at all!\n\nAccording to our records, the email [**angutierrez@csdo.org**](mailto:angutierrez@csdo.org) is linked to both a Clever **Teacher** account and a Clever **Staff** account. The Clever Teacher account is associated with **St. Joseph School - Pinole**, while the Clever Staff account is associated with both **St. Joseph School - Pinole** and **St. John the Baptist**.\n\nThe reason GoGuardian is only connected to your teacher account, and not your staff account, is due to the sharing rules for GoGuardian at St. Joseph School - Pinole, which only include teachers and students from the sections listed below. Non-teaching staff are not included.\n\nHowever, when I impersonated your teacher account with GoGuardian access, I was unable to see any students or sections there. I believe there should still be users visible in your teacher account, so I wanted to confirm if this aligns with the issue you're experiencing before proceeding with the next steps.\n\nIf needed, feel free to schedule a time to meet tomorrow or Thursday using the link below. I look forward to hearing from you soon!\n\nScheduling Link: https://calendly.com/jide-oke\n\nKind Regards,"
      },
      {
        "title": "Savvas SuccessMaker Sharing Settings",
        "content": "Hello Jordan 👋,\n\nI hope you're having a wonderful day. Thank you for reaching out to Clever Support – I'm happy to assist you!\n\nYes, you can adjust the sharing settings for **Savvas SuccessMaker**, but you'll need to update the sharing rules in your district's Clever Dashboard for this application. At the moment, Savvas SuccessMaker is shared with all 7 schools in your district.\n\nTo share it with just one school, you'll need to follow these steps:\n\n1. Click 'Change' on [this](https://schools.clever.com/sharing/ilpro-successmaker/district) page in the Clever Dashboard.\n2. Select 'Share by Schools'.\n3. Choose the specific school you'd like to share Savvas SuccessMaker with.\n\nIf I've misunderstood your request, I apologize for any confusion, and please feel free to clarify. Should you have any additional questions or concerns, don't hesitate to reach out – I'm here to help! For more insights on sharing rules, you might find this informative article helpful: [Sharing Permissions: Share by Rules](https://support.clever.com/s/articles/115000392247?language=en_US)\n\nKind Regards,"
      },
      {
        "title": "ABCMouse Clever Library App Support Inquiry",
        "content": "Hello ***Krystal*** & ***ABCMouse Support***,\n\nI hope you're doing well. In the previous message, Krystal mentioned that your team could connect directly with the teacher to offer further assistance or address any additional questions. However, we haven't received any follow-up, and the issue is still ongoing for the teacher.\n\nBefore moving forward, I want to clarify a few things to ensure I understand correctly:\n\n- Are you saying that support for the ABCMouse Clever Library app is not provided by ABCMouse for the San Diego Unified School District or the teacher in question due to them not having ABCMouse Enterprise accounts?\n- If that's the case, why wasn't this made clear in ABCMouse's initial response from September 23rd? I only ask because this would have saved the district time from reaching out to ABCMouse and requesting updates, if this issue was never being addressed due to the teacher having a ABCMouse Clever Library Account.\n\nAdditionally, is this issue currently being worked on, or has the status remained unchanged since September 16th? Could you please provide an update on the current status, any progress made, the cause of the issue on ABCMouse's end, and whether this affects just this teacher or all teachers using the ABCMouse Clever Library app?\n\nPlease be as direct and thorough as possible in your response to ensure all our questions are fully addressed. This will help us avoid unnecessary follow-ups with ABCMouse Support. Please note, we're not trying to be harsh; we genuinely want to understand the status of this issue, whether it has been worked on from the start, and what we should communicate to the districts that use the ABCMouse Clever Library app.\n\nKind Regards,"
      },
      {
        "title": "Accelerated Reader Saved Passwords Application Update",
        "content": "Hello Kristopher,\n\nI hope you're doing well. After some testing, it appears that the HTTP 500 Internal Server Error is no longer occurring for students using the Accelerated Reader Saved Passwords application. When you have a moment, could you kindly test this on your end to confirm?\n\nPlease feel free to reach out if you have any additional questions or concerns. I'm more than happy to assist!\n\nKind Regards,"
      },
      {
        "title": "Pearson - aimswebPlus Sync Issues",
        "content": "Hello Andy,\n\nI hope you're doing well. I wanted to follow up as we have not yet received any response from **Pearson - aimswebPlus Support**. I sincerely apologize for the delay. In the meantime, I've done some research to help us understand what might be happening with Pearson - aimswebPlus. Here's what I've found:\n\n- It appears that not only student **63347ed5326be905703ca5a0** is encountering the error message when launching Pearson - aimswebPlus from Clever, but all other students in your district are experiencing the same issue when accessing Pearson - aimswebPlus through the Clever Portal.\n- In similar cases involving **Pearson - aimswebPlus**, they have indicated that they will not proceed with an **initial sync** unless all [Data Quality Errors](https://schools.clever.com/applications/pearson-aimswebplus/warnings) for the district are resolved. This means the sync may not have occurred for your district yet, as there are unresolved errors on the [Data Quality page](https://schools.clever.com/applications/pearson-aimswebplus/warnings) for Pearson - aimswebPlus.\n\n**Next Steps:**\n\nSince we have not heard back from Pearson - aimswebPlus, we can begin by addressing these Data Quality Errors.\n\nSpecifically, **7** students are missing **race** data in Clever, **2** teachers are missing **email** addresses, **1** teacher is missing **username** data, and **9** teachers are not currently enrolled in any sections but are shared with Pearson - aimswebPlus. It may be best to resolve the other concerns first, leaving the 9 teachers for last. If the corresponding data is updated in Infinite Campus, it should sync with Clever.\n\nPlease feel free to reach out if you have any questions or need further assistance. I'm here to help!\n\nKind Regards,"
      },
      {
        "title": "School_ID and sch_schoolGUID Update",
        "content": "Hello Gabriel,\n\nThank you for reaching out! The School_ID fields in question are automatically rostered from Infinite Campus, specifically pulled from the sch_schoolGUID field. Our records indicate that the sch_schoolGUID for the two schools below in Infinite Campus are as follows:\n\n    •    White Academy Middle: 40232A8D-EA87-4186-9CED-700B1A2E951D\n    •    Michelle Obama STEM Academy: B88F0EA8-1F91-4627-A8CC-A2A2AAF46F8A\n\nTo make the switch, your SIS Admin would need to update the sch_schoolGUIDs for these schools within Infinite Campus. Once updated, the changes will automatically sync with Clever during the next roster update.\n\nPlease note that changing the School_ID for these schools will affect all users and classes associated with them in Clever. Since a school’s Clever_ID is directly tied to its School_ID, such a change would require a SIS ID conversion to retain historical data.\n\nIf your SIS Admin confirms that the desired sch_schoolGUID is already correctly reflected in Infinite Campus, but the changes are not appearing in Clever, please let me know. In that case, we can arrange a screen-sharing session to troubleshoot with our engineers.\n\nTo proceed, the first step is to verify what is currently listed under the sch_schoolGUID for White Academy Middle in Infinite Campus. Your SIS Admin can provide a screenshot of this field if needed. Once we have that confirmation, we’ll reach out with next steps.\n\nIf you have any additional questions or concerns, please don’t hesitate to reach out—I’m here to help! Additionally, if I’ve misunderstood any part of your request, I sincerely apologize and would be happy to clarify."
      },
      {
        "title": "Primary School Assignment Logic in Clever",
        "content": "Hello Karen,\n\nThank you for your message—no worries at all. I’ve reviewed the backend, and you are correct—the student in question is currently listed with Whitmore Lake Elementary as their primary school in PowerSchool.\n\nAt present, your Clever instance assigns a student’s primary school based on where they have the majority of their sections. However, we can modify this logic so that Clever strictly assigns the primary school based on what is listed in the SIS, rather than using section counts.\n\nPlease let me know if you’d like to proceed with this change, and I’ll be happy to implement it for you. Kindly note that this update will affect all students, assigning their primary school in Clever strictly based on what is recorded in the SIS.\n\nAdditionally, for situations like this student—where the number of sections is tied across multiple schools—Clever currently determines the primary school by selecting the school with the higher total student enrollment in those sections. If you choose to switch to strictly using PowerSchool as the source of truth, the student’s primary school, as well as all others, will align directly with what’s listed in the SIS.\n\nPlease let me know how you’d like to proceed, or if you have any questions—I’m here to assist!"
      }
    ]
  }